CDiamondGit/stm32SpaceInvaders/src/main.c
/*
 * 10. MAIN
 */
int main(void) {
  /* Hardware */
  initClock();
  initSysTick();
  setupIO();
  initSound();
  initSound2();

  // Game Begins
  while (1) {
    // Switch statement for our Game State
    switch (currentAppState) {
      case MAINMENU:
        mainMenu(&currentAppState);
        break;
      case HELP:
        help(&currentAppState);
        break;
      case PLAYING:
        start_sound_effect_ch1(enter_game_notes, enter_game_times,
                               enter_game_note_count, 0);
        start_sound_effect_ch2(enter_game_notes2, enter_game_times2,
                               enter_game_note_count2, 0);
        delay(500);
        playing(&currentAppState);
        break;

      default:
        break;
    }
  }

  return 0;
}

/*
 * FUNCTION DEFINITIONS
 */

/* --- Sound / timing / interrupts ----------------------------------------- */
void start_sound_effect_ch1(const uint32_t notes[],
                            const uint32_t times[],
                            uint32_t count,
                            uint32_t repeat) {
  if (count == 0) {
    return;
  }

  __disable_irq();
  channel1_notes = notes;
  channel1_times = times;
  channel1_note_count = count;
  channel1_repeat = repeat;
  channel1_note_index = 0;
  channel1_note_timer = channel1_times[0];

  playNote(channel1_notes[0]);
  __enable_irq();
}
void start_sound_effect_ch2(const uint32_t notes[],
                            const uint32_t times[],
                            uint32_t count,
                            uint32_t repeat) {
  if (count == 0) {
    return;
  }

  __disable_irq();
  channel2_notes = notes;
  channel2_times = times;
  channel2_note_count = count;
  channel2_repeat = repeat;
  channel2_note_index = 0;
  channel2_note_timer = channel2_times[0];

  playNote2(channel2_notes[0]);
  __enable_irq();
}
void SysTick_Handler(void) {
  milliseconds++;

  /* channel 1 */
  if (channel1_notes != 0) {
    if (channel1_note_timer > 0)
      channel1_note_timer--;

    if (channel1_note_timer == 0) {
      channel1_note_index++;

      if (channel1_note_index >= channel1_note_count) {
        if (channel1_repeat == 0) {
          channel1_notes = 0;
          channel1_times = 0;
          channel1_note_count = 0;
          channel1_note_index = 0;
          channel1_note_timer = 0;
          stopSound();
        } else {
          channel1_note_index = 0;
        }
      }

      if (channel1_notes != 0) {
        channel1_note_timer = channel1_times[channel1_note_index];
        playNote(channel1_notes[channel1_note_index]);
      }
    }
  }

  /* channel 2 */
  if (channel2_notes != 0) {
    if (channel2_note_timer > 0)
      channel2_note_timer--;

    if (channel2_note_timer == 0) {
      channel2_note_index++;

      if (channel2_note_index >= channel2_note_count) {
        if (channel2_repeat == 0) {
          channel2_notes = 0;
          channel2_times = 0;
          channel2_note_count = 0;
          channel2_repeat = 0;
          channel2_note_index = 0;
          channel2_note_timer = 0;
          stopSound2();
        } else {
          channel2_note_index = 0;
        }
      }

      if (channel2_notes != 0) {
        uint32_t base_time = channel2_times[channel2_note_index];
        uint32_t scaled_time =
            (base_time * background_tempo_ms) / SOUND_DEFAULT_TEMPO;

        if (scaled_time == 0)
          scaled_time = 1;

        channel2_note_timer = (int32_t)scaled_time;
        playNote2(channel2_notes[channel2_note_index]);
      }
    }
  }
}
static uint32_t get_background_tempo_ms(void) {
  uint16_t lowestY = getLowestAlienY();
  if (lowestY == 0)
    return 500;

  uint16_t gap = HUD_LINE_Y - lowestY;

  if (gap > 90)
    return 420;
  if (gap > 65)
    return 320;
  if (gap > 40)
    return 240;
  if (gap > 20)
    return 180;
  return 130;
}
static void start_background_music(void) {
  background_tempo_ms = get_background_tempo_ms();
  start_sound_effect_ch2(background_notes, background_times,
                         background_note_count, 1);
}
static void update_background_music(uint32_t now) {
  (void)now;

  uint32_t new_tempo = get_background_tempo_ms();
  if (new_tempo == background_tempo_ms)
    return;

  __disable_irq();

  if (channel2_notes != 0 && background_tempo_ms != 0) {
    channel2_note_timer = (channel2_note_timer * (int32_t)new_tempo) /
                          (int32_t)background_tempo_ms;

    if (channel2_note_timer <= 0)
      channel2_note_timer = 1;
  }

  background_tempo_ms = new_tempo;

  __enable_irq();
}
static void stop_sound_effect_ch1(void) {
  __disable_irq();
  channel1_notes = 0;
  channel1_times = 0;
  channel1_note_count = 0;
  channel1_repeat = 0;
  channel1_note_index = 0;
  channel1_note_timer = 0;
  stopSound();
  __enable_irq();
}
static void stop_sound_effect_ch2(void) {
  __disable_irq();
  channel2_notes = 0;
  channel2_times = 0;
  channel2_note_count = 0;
  channel2_repeat = 0;
  channel2_note_index = 0;
  channel2_note_timer = 0;
  stopSound2();
  __enable_irq();
}
/* --- Hardware setup ------------------------------------------------------- */
void pinMode(GPIO_TypeDef* port, uint32_t pin, uint32_t mode) {
  uint32_t val = port->MODER;
  val &= ~(3u << (pin * 2));
  val |= (mode << (pin * 2));
  port->MODER = val;
}
static void enablePullUp(GPIO_TypeDef* port, uint32_t pin) {
  port->PUPDR &= ~(3u << (pin * 2));
  port->PUPDR |= (1u << (pin * 2));
}
static void initClock(void) {
  RCC->CR &= ~(1u << 24);
  while (RCC->CR & (1 << 25))
    ;

  FLASH->ACR |= (1 << 0); /* 1 wait-state     */
  FLASH->ACR &= ~((1u << 2) | (1u << 1));
  FLASH->ACR |= (1 << 4); /* prefetch on      */

  RCC->CFGR &= ~((1u << 21) | (1u << 20) | (1u << 19) |
                 (1u << 18)); /* PLL x12 -> 48MHz */
  RCC->CFGR |= ((1 << 21) | (1 << 19));
  RCC->CFGR |= (1 << 14); /* ADC /4           */
  RCC->CR |= (1 << 24);   /* PLL on           */
  RCC->CFGR |= (1 << 1);  /* PLL as sysclk    */
}
static void initSysTick(void) {
  SysTick->LOAD = 48000;
  SysTick->CTRL = 7;
  SysTick->VAL = 10;
  __asm(" cpsie i ");
}
static void setupIO(void) {
  RCC->AHBENR |= (1 << 18) | (1 << 17);
  display_begin();
  pinMode(GPIOB, 4, 0);
  enablePullUp(GPIOB, 4); /* right – PB4  */
  pinMode(GPIOB, 5, 0);
  enablePullUp(GPIOB, 5); /* left  – PB5  */
  pinMode(GPIOA, 8, 0);
  enablePullUp(GPIOA, 8); /* fire  – PA8  */
  pinMode(GPIOA, 11, 0);
  enablePullUp(GPIOA, 11); /* down  – PA11 */
}

