CDiamondGit/stm32SpaceInvaders/src/main.c
  /* Game */
  initGameState();

  delay(300);

  /* Initial draw */
  renderAliens();
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
  drawLine(0, HUD_LINE_Y, SCREEN_W, HUD_LINE_Y, HUD_LINE_COLOR);

  start_background_music();

  PlayingState currentPlayingState = GAMERUNNING;
  int done = 0;

  while (!done) {
    int done2 = 0;
    switch (currentPlayingState) {
      case GAMERUNNING:

        /* Game loop */
        while (1) {
          uint32_t now = milliseconds;
          if (now - lastUpdate < FRAME_DELAY)
            continue;
          lastUpdate = now;

          if (gs.lives == 0)
            return;

          /* Advance bullet */
          if (gs.bullet.state == BULLET_FIRE) {
            gs.bullet.coords.y -= gs.bullet.speed;
            if (gs.bullet.coords.y < 5) {
              resetPlayerBullet();
              // renderPlayerBullet();
            }
          } else {
            gs.bullet.coords.x = gs.ship.coords.x + BULLET_OFFSET_X;
            gs.bullet.coords.y = gs.ship.coords.y - BULLET_OFFSET_Y;
          }

          AlienGrid* ag = &gs.aliens;

          for (int j = 0; j < ALIEN_COLS; j++) {
            Bullet* b = &ag->ab[j];
            if (b->state == BULLET_FIRE) {
              b->coords.y += b->speed; /* alien bullets go DOWN */
              if (b->coords.y > HUD_LINE_Y - 5)
                resetAlienBullet(j);
            }
            /* READY bullets track the grid in moveAliens/parkAlienBullet */
          }

          handleInput();   /* buttons-> positions*/
          moveAliens(now); /* now = time, timer-> alien grid shift */
          // updateAlienFire(now);
          update_background_music(now);
          updatePlayerCollision(); /* bullet    -> alien grid       */
          /*
          TODO :
          implement alien bullet. | redrawing every alien that has overlapped
          with bullet
          */

          if (updateAlienBulletCollision()) {
            resetGame();
            continue;
          }

          if (checkGameOver()) {
            stop_sound_effect_ch1();
            stop_sound_effect_ch2();
            resetGame();
            continue;
          }
          renderScene(); /* positions -> screen           */
        }
        break;
      case PAUSE:
        *as = MAINMENU;
        done = 1;
        break;
      case GAMEOVER:
        break;
      default:
        break;
    }
  }
}

/* --- Input ---------------------------------------------------------------- */
static void handleInput(void) {
  /* Right – PB4 */
  if ((GPIOB->IDR & (1 << 4)) == 0) {
    if (gs.ship.coords.x < SHIP_MAX_X)
      gs.ship.coords.x += gs.ship.speed;
  }

  /* Left – PB5 */
  if ((GPIOB->IDR & (1 << 5)) == 0) {
    if (gs.ship.coords.x > SHIP_MIN_X)
      gs.ship.coords.x -= gs.ship.speed;
  }

  /* Fire – PA8 */
  if ((GPIOA->IDR & (1 << 8)) == 0) {
    if (gs.bullet.state == BULLET_READY) {
      gs.bullet.state = BULLET_FIRE;
      start_sound_effect_ch1(shoot_notes, shoot_times, shoot_note_count, 0);
    }
  }
}

/* --- Alien movement / firing --------------------------------------------- */
static int isAlienGridMt(void) {
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] == 0) {
        return 0;
      }
    }
  }
  return 1;
}
static uint16_t getLowestAlienY(void) {
  AlienGrid* ag = &gs.aliens;
  for (int i = ALIEN_ROWS - 1; i >= 0; i--) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] == 0) {
        // lowest alive alien Y position
        return (uint16_t)(ag->offsetY + ag->basePosY[i] + ALIEN_H);
      }
    }
  }

  return 0;  // no-alien alive.
}
static void moveAliens(uint32_t now) {
  AlienGrid* ag = &gs.aliens;

  if (now - ag->lastMoveTime < ALIEN_MOVE_MS)
    return;

  ag->lastMoveTime = now;
  if (isAlienGridMt()) {
    initAlienGrid();
  }

  ag->oldOffsetX = ag->offsetX;
  ag->oldOffsetY = ag->offsetY;

  printNumber(ag->offsetY + ag->basePosY[2], 0, 0, 1, 0);

  int16_t nextX = ag->offsetX + (ALIEN_STEP * ag->dirX);
  ag->earToggle = !ag->earToggle;

  if (nextX < ALIEN_MIN_X || nextX > ALIEN_MAX_X) {
    /* Hit a wall: drop down, reverse direction, no horizontal step */

    // random fire on wall hit,
    // TODO: take this function out and only run in certain interval instead of
    // every wall hit...
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->ab[j].state == BULLET_READY && shouldFire(12))
        ag->ab[j].state = BULLET_FIRE;
    }
    ag->offsetY += ALIEN_DROP;
    ag->dirX *= -1;
  } else {
    ag->offsetX = nextX;
  }

  for (int j = 0; j < ALIEN_COLS; j++) {
    if (ag->ab[j].state == BULLET_READY)
      parkAlienBullet(j);
  }
}
static void updateAlienFire(uint32_t now) {
  AlienGrid* ag = &gs.aliens;
  for (int j = 0; j < ALIEN_COLS; j++) {
    if (ag->ab[j].state != BULLET_READY)
      continue; /* already in flight */

    int hasAlive = 0;
    for (int i = 0; i < ALIEN_ROWS; i++)
      if (ag->status[i][j] == 0) {
        hasAlive = 1;
        break;
      }
    if (!hasAlive)
      continue;

    if (now >= ag->nextFireTime[j]) {
      ag->ab[j].state = BULLET_FIRE;
      ag->nextFireTime[j] = now + randomFireDelay();
    }
  }
}

/* --- Collision / bullet state -------------------------------------------- */
static int checkCollision(uint16_t o1X,
                          uint16_t o1Y,
                          uint16_t o1w,
                          uint16_t o1h,
                          uint16_t o2X,
                          uint16_t o2Y,
                          uint16_t o2w,
                          uint16_t o2h) {
  if (o1X + o1w <= o2X)
    return 0;
  if (o1X >= o2X + o2w)
    return 0;
  if (o1Y + o1h <= o2Y)
    return 0;
  if (o1Y >= o2Y + o2h)
    return 0;
  return 1;
}
/*
Alien bullet reset
*/
static void resetAlienBullet(int col) {
  AlienGrid* ag = &gs.aliens;
  Bullet* b = &ag->ab[col];
  /* Erase both positions */
  fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H, 0);
  fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H, 0);
  parkAlienBullet(col);
}
/*
Player Bullet Reset
*/
static void resetPlayerBullet(void) {
  Bullet* b = &gs.bullet;
  gs.bullet.state = BULLET_READY;

  fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H + 5, 0);

  gs.bullet.coords.x = gs.bullet.coords.oldX =
      gs.ship.coords.x + BULLET_OFFSET_X;
  gs.bullet.coords.y = gs.bullet.coords.oldY =
      gs.ship.coords.y - BULLET_OFFSET_Y;
}
static void repairAliensUnderRect(uint16_t rx,
                                  uint16_t ry,
                                  uint16_t rw,
                                  uint16_t rh) {
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] != 0)
        continue;
      uint16_t ax = (uint16_t)(ag->offsetX + ag->basePosX[j]);
      uint16_t ay = (uint16_t)(ag->offsetY + ag->basePosY[i]);
      if (checkCollision(ax, ay, ALIEN_W, ALIEN_H, rx, ry, rw, rh)) {
        /* Which sprite to use for this row */
        const uint16_t* spr = (i == 0)   ? redAlien[ag->earToggle]
                              : (i == 1) ? greenAlien[ag->earToggle]
                                         : blueAlienBoth[ag->earToggle];
        putImage(ax, ay, ALIEN_W, ALIEN_H, spr, 1, 0);
      }
    }
  }
}
static int updateAlienBulletCollision(void) {
  AlienGrid* ag = &gs.aliens;
  int hit = 0;
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;
    if (checkCollision(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H,
                       b->coords.x, b->coords.y, BULLET_W, BULLET_H)) {
      resetAlienBullet(j);
      hit = 1;
    }
  }
  return hit;
}
static void updatePlayerCollision(void) {
  if (gs.bullet.state != BULLET_FIRE)
    return;

